cmsis-svd/cmsis-svd/data/SiliconLabs/EFM32HG108F32.svd
        <register>
          <name>LFBPRESC0</name>
          <description>Low Frequency B Prescaler Register 0 (Async Reg)</description>
          <addressOffset>0x070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>LEUART0</name>
              <description>Low Energy UART 0 Prescaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>LFBCLKLEUART0 = LFBCLK</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>LFBCLKLEUART0 = LFBCLK/2</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>LFBCLKLEUART0 = LFBCLK/4</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>LFBCLKLEUART0 = LFBCLK/8</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNTCTRL</name>
          <description>PCNT Control Register</description>
          <addressOffset>0x078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>PCNT0CLKEN</name>
              <description>PCNT0 Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT0CLKSEL</name>
              <description>PCNT0 Clock Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROUTE</name>
          <description>I/O Routing Register</description>
          <addressOffset>0x080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>CLKOUT0PEN</name>
              <description>CLKOUT0 Pin Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKOUT1PEN</name>
              <description>CLKOUT1 Pin Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCATION</name>
              <description>I/O Location</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOC0</name>
                  <description>Location 0</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC1</name>
                  <description>Location 1</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC2</name>
                  <description>Location 2</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC3</name>
                  <description>Location 3</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <description>Configuration Lock Register</description>
          <addressOffset>0x084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>LOCKKEY</name>
              <description>Configuration Lock Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCKED</name>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USBCRCTRL</name>
          <description>USB Clock Recovery Control</description>
          <addressOffset>0x0D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Clock Recovery Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSMODE</name>
              <description>Low Speed Clock Recovery Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USHFRCOCTRL</name>
          <description>USHFRCO Control</description>
          <addressOffset>0x0D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000FF040</resetValue>
          <resetMask>0x000FF37F</resetMask>
          <fields>
            <field>
              <name>TUNING</name>
              <description>USHFRCO frequency adjust</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DITHEN</name>
              <description>USHFRCO dither enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUSPEND</name>
              <description>USHFRCO suspend</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>USHFRCO Timeout</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USHFRCOTUNE</name>
          <description>USHFRCO Frequency Tune</description>
          <addressOffset>0x0D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>FINETUNING</name>
              <description>Oscillator fine frequency adjust</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USHFRCOCONF</name>
          <description>USHFRCO Configuration</description>
          <addressOffset>0x0DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000017</resetMask>
          <fields>
            <field>
              <name>BAND</name>
              <description>USHFRCO Band Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>48MHZ</name>
                  <description>48 MHz band. NOTE: Also set the TUNING and FINETUNING value when changing band.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24MHZ</name>
                  <description>24 MHz band. NOTE: Also set the TUNING and FINETUNING value when changing band.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USHFRCODIV2DIS</name>
              <description>USHFRCO divider for HFCLK disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
